DataProcessors/ПомощникПереносаПодписанныхДанныхXMLВПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПереносаПодписанныхДанныхXMLВПрисоединенныеФайлы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПодписанныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодписанныеДанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СоставПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеАктуальны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанныеДанныеФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписанныеДанныеПОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПомощникПереносаПодписанныхДанныхXMLВПрисоединенныеФайлы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПеренестиХранениеПодписанныхДанныхМногопоточныйРежим(Поток, ПараметрыЗагрузки) Экспорт
	
	ОшибкаПереноса = Ложь;
	МассивЗадач = ПараметрыЗагрузки.МассивЗадач;
	ВсегоЗадач = ПараметрыЗагрузки.ВсегоЗадач; 
	РазмерПорции = ПараметрыЗагрузки.РазмерПорции;
	ПроверятьПодписанныеДанные = ПараметрыЗагрузки.ПроверятьПодписанныеДанные;
	УдалятьПодписанныеДанные = ПараметрыЗагрузки.УдалятьПодписанныеДанные;
	
	ПорцияЗадачДляПереноса = ПолучитьТаблицуЗадач(МассивЗадач);
    ПеренестиХранениеПодписанныхДанных(ПорцияЗадачДляПереноса, ПроверятьПодписанныеДанные, УдалятьПодписанныеДанные);
	
	ПроцентПрогресса = ?(ПараметрыЗагрузки.ВсегоЗадач > 0, (ПараметрыЗагрузки.НомерПотока * РазмерПорции)/ПараметрыЗагрузки.ВсегоЗадач, 0);
	ДлительныеОперации.СообщитьПрогресс(ПроцентПрогресса * 100);
	
КонецПроцедуры 


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПеренестиХранениеПодписанныхДанных(ЗадачиПорции, ПроверятьПодписанныеДанные, УдалятьПодписанныеДанные)
	
	Если ЗадачиПорции = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ОшибкаПереноса = Ложь;
	МодульЭлектроннаяПодпись = ОбщегоНазначения.ОбщийМодуль("ЭлектроннаяПодпись"); 
	СобытиеЖурналаРегистрации = НСтр("ru = 'Перенос подписанных данных в присоединенные файлы'");
	
	НачатьТранзакцию(); 
	Попытка
		
	Для Каждого ТекущаяЗадача Из ЗадачиПорции Цикл
		Если Не ТипЗнч(ТекущаяЗадача.ПодписанныеДанные) = Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеХранилища = ТекущаяЗадача.ПодписанныеДанные.Получить();
		
		Если ДанныеХранилища = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		ФайлПодписанныеДанныеПОД = Неопределено; 
		ПрисоединенныйФайл = Неопределено;
		ФайлПодписанныеДанныеПОД = ПроцессыОбработкиДокументов.ПоместитьПодписанныеДанныеВПрисоединенныйФайл(ТекущаяЗадача.Задача, 
								   ДанныеХранилища, ПрисоединенныйФайл);
		
		Если Не ЗначениеЗаполнено(ФайлПодписанныеДанныеПОД)
			ИЛИ Не ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
			 ОшибкаПереноса = Истина;
			 ТекущаяЗадачаПредставление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяЗадача.Задача, "Представление");
			 ШаблонУточнения = НСтр("ru='По задаче %1 не удалось сохранить подписанные данные в присоединенный файл'");
			 УточненныйТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУточнения, ТекущаяЗадачаПредставление);
			 Прервать;
		КонецЕсли;	
		
		//установить подпись на присоединенный файл 
		ПараметрыПолученияПодписей = МодульЭлектроннаяПодпись.НовыйПараметрыПолученияПодписейОбъекта();
		ПараметрыПолученияПодписей.ВозвращатьСертификатыИзПодписей = Истина;
		ПараметрыПолученияПодписей.ПорядковыйНомер = 1;
		
		ПодписиЗадачи = МодульЭлектроннаяПодпись.ПодписиОбъекта(ТекущаяЗадача.Задача, ПараметрыПолученияПодписей);
		
		Если ПодписиЗадачи.Количество() > 0 Тогда
			МодульЭлектроннаяПодпись.ДобавитьПодпись(ПрисоединенныйФайл, ПодписиЗадачи[0]);
		КонецЕсли;
		
		// проверяем хэш файлов в хранилище до переноса и в присоединенном файле после переноса
		Если ПроверятьПодписанныеДанные Тогда
			ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл, Истина);
			Если ДвоичныеДанныеФайла <> Неопределено Тогда
				
				ХэшДанныхХранилища = Новый ХешированиеДанных(ХешФункция.MD5);
				ХэшДанныхХранилища.Добавить(ДанныеХранилища); 
				
				ХэшДанныхПрисоединенногоФайла = Новый ХешированиеДанных(ХешФункция.MD5);
				ХэшДанныхПрисоединенногоФайла.Добавить(ДвоичныеДанныеФайла); 
				
				Если ХэшДанныхХранилища.ХешСумма <> ХэшДанныхПрисоединенногоФайла.ХешСумма Тогда
					ОшибкаПереноса = Истина;
					ТекущаяЗадачаПредставление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяЗадача.Задача, "Представление");
                    ШаблонУточнения = НСтр("ru='По задаче %1 данные в хранилище значений и в присоединенном файле не идентичны'");
					УточненныйТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУточнения, ТекущаяЗадачаПредставление);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// очистка данных в хранилище значений из регистра ПодписанныеДанные
		Если УдалятьПодписанныеДанные Тогда
			ТекущаяЗадача.ПодписанныеДанные = Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;
		
		ТекущаяЗадача.ПодписанныеДанныеФайл = ФайлПодписанныеДанныеПОД;

	КонецЦикла;
	
	Если ОшибкаПереноса Тогда
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка,,, УточненныйТекст);
		
		ВызватьИсключение(УточненныйТекст);
		
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить();
	ЭлементБлокировки.Область = "РегистрСведений.ПодписанныеДанные";
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ЗадачиПорции;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задача", "Задача");
	Блокировка.Заблокировать(); 
	
	РежимЗаписиНабораЗаписей = ОбщегоНазначения.РежимОбновленияНабораЗаписей(); 
	Если РежимЗаписиНабораЗаписей = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ЗадачиПорции Цикл
			
			НаборЗаписей = РегистрыСведений.ПодписанныеДанные.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Задача.Установить(ТекущаяСтрока.Задача);
			НаборЗаписей.Прочитать();
			
			НаборЗаписей[0].ПодписанныеДанные = ТекущаяСтрока.ПодписанныеДанные; 
			НаборЗаписей[0].ПодписанныеДанныеФайл = ТекущаяСтрока.ПодписанныеДанныеФайл;

			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;	
	Иначе	
		
		НаборЗаписей = РегистрыСведений.ПодписанныеДанные.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ЗадачиПорции);

		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, РежимЗаписиНабораЗаписей);
 
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();

    Исключение

		ОтменитьТранзакцию(); 
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		УточненныйТекст = НСтр("ru = 'Не удалось перенести подписанные данные в присоединенные файлы'");
		
		Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке, УточненныйТекст);
		
		ВызватьИсключение(Уточнение.Текст, Уточнение.Категория,,, ИнформацияОбОшибке);
		
	КонецПопытки;
		
КонецПроцедуры

Функция ПолучитьТаблицуЗадач(МассивЗадач)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗадач", МассивЗадач);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Задача,
	|	РегистрСведенийПодписанныеДанные.СоставПодписи КАК СоставПодписи,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанные КАК ПодписанныеДанные,
	|	РегистрСведенийПодписанныеДанные.ДанныеАктуальны КАК ДанныеАктуальны,
	|	РегистрСведенийПодписанныеДанные.ДатаПроверкиДанных КАК ДатаПроверкиДанных,
	|	РегистрСведенийПодписанныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанныеФайл КАК ПодписанныеДанныеФайл
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеДанные КАК РегистрСведенийПодписанныеДанные
	|		ПО (РегистрСведенийПодписанныеДанные.Задача = ЗадачаПоОбработкеДокумента.Ссылка)
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.ПодписанЭП
	|	И ЗадачаПоОбработкеДокумента.Ссылка В(&МассивЗадач)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачаПоОбработкеДокумента.Дата";	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить(); 
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

#КонецОбласти     

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПеренестиХранениеПодписанныхДанныхМногопоточныйРежим", Истина);
КонецПроцедуры

#КонецЕсли
